views/layouts/common.php

        </div>
        <div class="small-profile-picture">
            <? $id = Yii::$app->user->identity->id;
                $user = \app\models\Tables\User::find()->select('avatar')->where(['id' => $id])->one(); ?>
---
SELECT `avatar` FROM `user` WHERE `id`=1