controllers/author/CreateBookController.php

SELECT * FROM `fandom` WHERE `id`='1'
SELECT * FROM `origin` WHERE `fandom_id`=1
---
    public function actionFindOrigins() {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $fandom = Yii::$app->request->post('fandom');
        $origins = []; $origins_data = [];
        if ($fandom)
            $origins = Fandom::findOne($fandom)->origins;

SELECT * FROM `character` WHERE (`full_name` LIKE '%а%') AND (`fandom_id`='1') ORDER BY `fandom_id` DESC, `full_name`
---
    public function actionFindCharacters() {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $fandoms = Yii::$app->request->post('selected_fandoms');
        $characters = Yii::$app->request->post('selected_characters');
        $input = Yii::$app->request->post('input');

        $data = [];
        $search = Character::find();
        $search->andFilterWhere(['like', 'full_name', $input]);
        if ($fandoms)
            $search->andWhere(['fandom_id' => $fandoms]);
        if ($characters)
            foreach ($characters as $character) $search->andWhere(['<>', 'id', $character]);
        $search->orderBy([
            // может, потом как-то это дело отсортировать по порядку, предложенному пользователем
            'fandom_id' => SORT_DESC,
            'full_name' => SORT_ASC
        ]);
        $search_result = $search->all();