models/Tables/Type.php

    public static function getTypesList()
    {
        return ArrayHelper::map(self::find()->all(), 'id', 'title');
---
SELECT * FROM `type`